CSI API ETABS v1

# cLoadCasesModHistNonlinear Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseModalHistoryNonlinear ModHistNonlinear { get; }

    ReadOnly Property ModHistNonlinear As cCaseModalHistoryNonlinear
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseModalHistoryNonlinear

    value = instance.ModHistNonlinear

    property cCaseModalHistoryNonlinear^ ModHistNonlinear {
    	cCaseModalHistoryNonlinear^ get ();
    }

    abstract ModHistNonlinear : cCaseModalHistoryNonlinear with get

#### Property Value

Type: cCaseModalHistoryNonlinear

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com